import { List, ListItem, Text } from "@mantine/core";

type Props = { params: { locale: string } };

export default async function PolicyPage({ params: { locale } }: Props) {
  // if (locale === &quot;en&quot;) {
  //   <>
  //     <Text fz='h1'>Privacy Policy</Text>
  //     <Text>...</Text>
  //   </>;
  // } else {
  //   return (
  //     <>
  //       <Text fz='h1'>سياسة الخصوصية</Text>
  //       <Text>...</Text>
  //     </>
  //   );
  // }
  return (
    <>
      <Text fz='h1'>سياسة الخصوصية</Text>
      <List className='text-justify'>
        <li>
          <Text fz='h2' fw={700}>
            1. الموافقة:
          </Text>
          <p>
            اي ام بي جي مصر ش. م. ل.، شركة محدودة المسؤولية، مركزها في Plot 176, Second Sector، التجمع الخامس . القاهرة
            الجديدة . محافظة القاهرة - مصر (المشار إليها فيما بعد بـ &quot;mwz3&quot;)، توفر، كما وتوفر فروعها و/أوالشركات التابعة
            لها، مجموعة من الموارد عبر الإنترنت التي تشمل الإعلانات المبوبة والمنتديات (المشار إليها فيما بعد بشكل
            جماعي: &quot;الخدمة&quot;) على الموقع الالكتروني mwz3.com.eg والمواقع ذات الصلة والتطبيق المحمول للمنصة (المشار إليها
            فيما بعد بشكل جماعي: &quot;الموقع الالكتروني&quot;).
          </p>
          <p>
            أنك تدرك وتقر وتوافق على أنك المسؤول الوحيد عن الالتزام بالتسجيل الضريبي في مصلحة الضرائب المصرية في حالة
            عرض السلع والخدمات وغيرها من الأنشطة الخاضعة للضريبة، ويعتبر التسجيل الضريبي والإلتزام بقوانين مصلحة الضرائب
            المصرية مسئولية شخصية خاصة بك دون أدنى مسئولية على موقع موزع
          </p>
          <p>
            أنك تدرك وتقر وتوافق على وجوب الإفصاح عن رقم التسجيل الضريبي الموحد للممول أو المكلف عند الإعلان عن السلع
            والخدمات وغيرها من الأنشطة الخاضعة للضريبة كجزء أساسي وإلزامي ضمن مكون الإعلان في الخانة المحددة لذلك
            والموضحة في إعدادات حسابك تحت بند المعلومات الشخصية، حتى لا تقع ضمن حالات التهرب الضريبي وذلك في إطار قرار
            وزير المالية رقم 345 لسنة 2021
          </p>
          <p>
            يتم توفير الموقع الالكتروني والخدمة لك وفقًا لشروط إستخدام mwz3الحالية (&quot;الشروط&quot;). لغرض الشروط وأينما يتطلب
            السياق ذلك، يعنى بعبارة &quot;أنت&quot; و &quot;لك&quot; أي شخص يستخدم بأي شكل من الأشكال الموقع الالكتروني أو الخدمة، بما في
            ذلك الأشخاص الذين يتصفحون الموقع الإلكتروني ومحتواه أو يضعون أية إعلانات أو محتوى على الموقع، ينشرون
            التعليقات أو أي محتوى أو يجاوبون أية إعلانات أو محتوى على الموقع الالكتروني.
          </p>
          <p>
            بوصولك إلى الموقع الإلكتروني أو استخدام الخدمات تقر بأنك قد قرأت هذه الشروط وفهمتها وتتعهد بالالتزام بها وأي
            تغيير أو تحديث يطرأ عليها من وقت لآخر وفق قرار mwz3 الوحيد.
          </p>
          <p>
            عند الدخول إلى أو التصفح أو استخدام الموقع الالكتروني أو الخدمة، إنك توافق على الالتزام بهذه الشروط.
            بالإضافة إلى ذلك، عند استخدام جزء من الخدمة، إنك توافق على الامتثال لأية إرشادات منشورة قابلة للتطبيق لمثل
            هذه الخدمة والتي قد تتغير أو يتم تحديثها من وقت لآخر وفقًا لتقدير mwz3الخاص. إنك تتفهم وتوافق على أنك
            المسؤول الوحيد عن مراجعة هذه الشروط من وقت لآخر. في حالة اعتراضك على أي بند أو شرط من هذه الشروط، أو أي مبدأ
            توجيهي، أو أية تغييرات لاحقة عليه أو تصبح غير راضٍ عن mwz3 أو الخدمة بأي شكل من الأشكال ، يكون خيارك الوحيد
            هو التوقف فوراً عن استخدام موقع mwz3 . من الممكن تحديث هذه الشروط من قِبل mwz3 في أي وقت وفقًا لتقديرها
            الخاص. قد ترسل لك mwz3 إشعارات بالتغييرات على الموقع الإلكتروني أو الشروط وفقًا للقسم xxi (I) من هذا
            المستند. قد توفر mwz3 ترجمة النسخة الإنجليزية للشروط إلى لغات أخرى. إنك تتفهم وتوافق على أن أية ترجمة للشروط
            إلى لغات أخرى هي فقط ملائمة لك وأن إصدار الشروط باللغة الإنجليزية يحكم شروط علاقتك مع mwz3 . علاوة على ذلك،
            في حال وجود أي تناقض بين النسخة الإنجليزية من الشروط وأية ترجمة، فإن النسخة الإنجليزية من الشروط تكون
            المعمول بها.
          </p>
        </li>
        <li>
          <Text fz='h2' fw={700}>
            2. وصف الخدمة وسياسة المحتوى
          </Text>
          <List withPadding className='list-decimal'>
            <li>
              mwz3 هو الجيل التالي من الإعلانات المبوبة المجانية على الإنترنت. نحن بمثابة منصة سوق عبر الإنترنت، تسمح
              لمستخدمينا الذين يلتزمون بهذه الشروط بعرض المنتجات والخدمات وبيعها وشرائها على الموقع الإلكتروني. في حال
              تتمكن من إجراء عمليات الدفع والمعاملات الأخرى من خلال الموقع الالكتروني عبر استخدام بائعين لطرف ثالث، فان
              mwz3 لا تشترك بأي شكل في مثل هذه المعاملات. ونتيجة لذلك، وكما تمت المناقشة بمزيد من التفصيل في هذه الشروط،
              إنك تقر وتوافق على أن mwz3 ليست طرفًا في مثل هذه المعاملات كما ان mwz3 لا تتحكم في أي عنصر من هذه
              المعاملات، ولن تتحمل أية مسؤولية تجاه أي طرف فيما يتعلق بهذه المعاملات. إنك تستخدم الخدمة والموقع
              الالكتروني على مسؤوليتك الخاصة.
            </li>

            <li>
              إنك تدرك أن mwz3 لا تتحكم وليست مسؤولة عن الإعلانات، ومعلومات الدليل، والقوائم /المعلومات التجارية،
              والرسائل بين المستخدمين بما في ذلك على سبيل المثال لا الحصر، رسائل البريد الإلكتروني المرسلة من خارج نطاق
              mwz3 أو غيرها من وسائل الاتصالات الإلكترونية سواء من خلال الموقع الإلكتروني أو موقع الطرف الثالث الآخر
              (المحدد أدناه) أو العروض أو التعليقات أو منشورات المستخدمين أو الملفات أو الصور أو الرسوم أو الفيديو أو
              الأصوات أو قوائم الأعمال/المعلومات ومعلومات الدليل أو أية مواد أخرى متوفرة عبر الموقع الإلكتروني والخدمة
              (&quot;المحتوى&quot;). كما انه عند استخدامك الموقع الالكتروني والخدمة، قد تتعرض لمحتوى مسيء أو غير لائق أو غير دقيق،
              او مضلل، أو غير مقبول أوموضوع إعتراض. أنك تقر وتوافق على أنك مسؤول عن وعليك أن تقيّم وتتحمل جميع المخاطر
              المرتبطة باستخدام أي محتوى. كما لا يجوز لك الاعتماد على المحتوى المذكور، وأنه لن تكون mwz3 تحت أي ظرف من
              الظروف مسؤولة بأي شكل من الأشكال عن المحتوى أو عن أي خسارة أو ضرر من أي نوع يحدث نتيجة للتصفح، استخدام أو
              قراءة أي محتوى مدون أو بريد إلكتروني أو غير ذلك متاح عبر الخدمة. إنك تقر وتوافق على أن mwz3 تسمح بعرض مثل
              هذه السلع والخدمات وتقديمها على الموقع الالكتروني الذي يتوافق مع الشروط المنصوص عليها في هذا المستند. ومع
              ذلك، لا تقوم mwz3 بإجراء فحص مسبق للمحتوى أو الموافقة عليه. انما يكون ل mwz3 الحق، وفقًا لتقديرها الخاص
              والمطلق، في رفض أو حذف أو نقل أي محتوى يكون متوفرا&quot; عبر الخدمة لانتهاك هذه الشروط وقد علمت mwz3 عن هكذا
              انتهاك أو لأي سبب آخر أو بدون سبب على الإطلاق. علاوة على ذلك، قد يحتوي الموقع الالكتروني والمحتوى المتاح
              عبر الموقع الإلكتروني على روابط لمواقع الكترونية أخرى تابعة لأطراف ثالثة، قد تخضع لشروط المواقع
              الالكترونية الخاصة بهذه الاطراف الثالثة (المواقع الالكترونية للأطراف الثالثة) والتي هي غير مرتبطة تمامًا
              بـ mwz3 ، وقد تخضع لشروط واحكام الموقع الالكتروني الخاص بهذه الأطراف الثالثة والسياسات الأخرى عند معاينتك
              الرابط التابع للأطراف الثالثة. لا تقوم mwz3 بأي تمثيل أو ضمان فيما يتعلق بدقة أو صحة المعلومات الموجودة في
              أي موقع من مواقع الأطراف الثالثة وربطك بأية مواقع أخرى يكون على مسؤوليتك الخاصة تمامًا، وتبرئ mwz3 ذمتها
              عن أي مسؤولية بهذا الخصوص.
            </li>

            <li>
              إنك تقر وتوافق على أنك المسؤول الوحيد عن المحتوى الخاص بك الذي تم وضعه، وإرساله عبر الخدمة أو ربطه بها
              وعواقب وضعه أو نقله أو ربطه أو نشره. وبشكل أكثر تحديدًا، أنك المسؤول الوحيد عن كامل المحتوى الذي تحمّله أو
              ترسله بالبريد الإلكتروني أو تقوم بإتاحته بطريقة أخرى عبر الخدمة. بحيث انه فيما يتعلق بمثل بهذا المحتوى
              الذي يتم وضعه أو نقله أو ربطه بالخدمة من قبلك، فإنك تؤكد وتقر وتعلن وتضمن التالي: i) لقد قمت بتطوير
              المحتويات مثل الوصف و/أو الصور وفقًا للتعليمات والإرشادات لوضع الإعلان المقدم من mwz3 على الموقع
              الالكتروني وتكون حينها جميع حقوق الطبع والنشر ل mwz3 ، فان تعتبر أنك تمتلك أية حقوق الطبع والنشر تقوم
              بتعيينها، فان أية حقوق ملكية فكرية من هذا القبيل تعود الى mwz3 ) انك تقر بأن المعلومات و/أو الصور
              الفوتوغرافية التي تنشرها على الموقع الإلكتروني يتم تخزينها وتجميعها بواسطة قاعدة بيانات خاصة من قبل mwz3 .
              كما ان تحميل المعلومات و/أو الصور التي تم تحميلها، تعدلها mwz3 من خلال تطبيق علامة لشعار mwz3 . تعود حقوق
              الطبع والنشر في مثل هذه الأعمال المشتقة الى mwz3 . iii) يجب عليك الاستمرار في الحصول على التراخيص
              والتصاريح والموافقات والأذونات اللازمة لاستخدام هذا المحتوى على الخدمة والموقع الإلكتروني عندما يكون
              المحتوى متوافرا&quot; على الموقع الإلكتروني (بما في ذلك على سبيل المثال لا الحصر ، جميع براءات الاختراع أو
              العلامات التجارية أو الأسرار التجارية أو حقوق الطبع والنشر أو حقوق الملكية الأخرى في أي من هذه المحتويات
              أو لأي منها وحيثما يقتضى الأمر. في مثل هذه الحالات حيث يكون لك الحق فيها، إنك تخوّل وترخص mwz3 لاستخدام
              هذا المحتوى حصريًا لتمكين تضمين المحتوى واستخدامه بالطريقة التي تتوقعها الخدمة والموقع الالكتروني وهذه
              الشروط. iv) انك تحصل على موافقة خطية و/او الابراء، ، و / أو إذن من كل فرد وكل شخص فردي محدد أو شركة تجارية
              محددة في المحتوى لاستخدام اسم أو تشابه كل شخص فردي أو تجاري محدد يمكن تحديده لتضمين واستخدام المحتوى عبر
              الطريقة المتوخاة من قبل الخدمة، والموقع الالكتروني وهذه الشروط. وللتوضيح، عن طريق تقديم أي محتوى على
              الموقع، على النحو السالف الذكر، أينما كنت تحتفظ بأية حقوق ملكية في المحتوى، انك تمنح بموجبه إلى mwz3
              ترخيصًا نهائيًا غير قابل للرجوع عنه أو غير قابل للإلغاء أو دائم أو عالمي أو حصري أو خالي من دفع رسوم
              التراخيص أو ترخيصًا من الباطن، او ترخيصا&quot; قابلاً للنقل بغية استخدام، إعادة إنتاج، توزيع، إعداد أعمال
              مشتقة، وعرض المحتوى وتنفيذه فيما يتعلق بالموقع الإلكتروني وشركة mwz3 (و خلفاؤها)، بما في ذلك على سبيل
              المثال لا الحصر لغرض تعزيز وإعادة توزيع جزء من أو كل الموقع الالكتروني والمحتوى الموجود فيه (والاعمال
              المشتقة منه) في أي من التنسيقات الاعلامية ومن خلال أية قنوات إعلامية معروفة الآن أو فيما بعد. علاوة على
              ذلك، من خلال وضعكم المحتوى على أية منطقة عامة من الخدمة وإلى الحد الذي تحتفظ فيه بأية ملكية لأية حقوق، إنك
              توافق وتمنح بموجبه mwz3 جميع الحقوق الحصرية اللازمة لحظر أو السماح لأي تجميع لاحق، أو عرض أو نسخ أو إعادة
              نسخ أو إعادة إنتاج أو استغلال المحتوى على الخدمة أو الموقع الالكتروني من قبل أي طرف لأي غرض بما في ذلك
              الحق في الشروع في اتخاذ إجراء قانوني وفقا لقوانين حقوق الطبع والنشر والقوانين الأخرى في مصر. كما إنك تمنح
              كل مستخدم للموقع ترخيصًا غير حصري للوصول إلى المحتوى الخاص بك عبر الموقع الإلكتروني. ينتهي الترخيص المذكور
              الممنوح بواسطتك لكل مستخدم بمجرد قيامك أو قيام mwz3 بإزالة أو حذف هذا المحتوى من الموقع الالكتروني.
            </li>
            <li>
              لا تدعم mwz3 أي محتوى أو أي رأي أو بيان أو توصية أو مشورة يتم التعبير عنها في هذه الوثيقة. تتنازل mwz3
              صراحة عن أية مسؤولية قانونية فيما يتعلق بمحتوى المستخدم. لا تسمح mwz3 بنشاطات انتهاك حقوق الطبع والنشر
              وانتهاك حقوق الملكية الفكرية على الموقع الالكتروني. ويجوز لـ mwz3 -وفقًا لتقديرها الخاص -إزالة أي محتوى
              يمثل انتهاكًا إذا تم إخطارها بشكل صحيح وفقًا للقانون المعمول به بأن هذا المحتوى ينتهك حقوق الملكية الفكرية
              للآخرين. تحتفظ mwz3 بالحق في إزالة أي محتوى دون إشعار مسبق. قد تقوم mwz3 أيضًا بإنهاء دخول المستخدم إلى
              الموقع الالكتروني إذا تم التحديد بأن التعديات تكون متكررة او في حال تم العثور على أي عمل يتعارض مع هذه
              الشروط. ان المتعدي المتكرر هو المستخدم الذي تم إشعاره بالنشاط المخالف لأكثر من مرتين و / أو تمت إزالة
              إرسال المستخدم من الموقع الالكتروني أكثر من مرتين. بالإضافة إلى ذلك، تحتفظ mwz3 ، بالحق في تقرير ما إذا
              كان أي محتوى مناسبًا ويتوافق مع هذه الشروط، وفقًا لتقديرها الخاص.
            </li>
            <li>
              قد توفر لك mwz3 خدمة فيديو إذا قمت بتحميل صور فوتوغرافية لإعلانك. وعند تحميل الصور الخاصة بك التي لا
              تغطيها 2(3)(i) أو (ii) أعلاه، فانك توافق وترخص بطريقة غير قابل للرجوع عنها للاستخدام الحصري لصورك
              الفوتوغرافية لهذه الخدمة، كما انك تؤكد وتضمن أن لديك كل الحق ، والصفة والمصلحة اللازمة لتحميل واستخدام
              الصور على هذه الخدمة. عند استخدام التطبيق أو الخدمة من قبل أطراف ثالثة تحت هذه الخدمة، يجوز لـ mwz3 ،
              وفقًا لتقديرها الخاص، خلق فيديو لصورك الفوتوغرافية وتحميل هذا الفيديو عبر www.youtube.com أو مزود خدمة آخر
              عملا&quot; بما تحدده mwz3 ووفقًا لتقديرها الخاص وتضمين الفيديو في إعلانك على الموقع الالكتروني.
            </li>
          </List>
        </li>

        <li>
          <Text fz='h2' fw={700}>
            3. إعلانات مميزة
          </Text>
          <p>
            قد تقدم mwz3 خدمة تُعرف باسم &quot;الإعلانات المميزة&quot; حيث يمكن للمستخدمين دفع رسوم غير قابلة للاسترداد لنشر
            إعلاناتهم في مواقع محددة على الموقع الالكتروني وبالتالي من المحتمل زيادة مشاهدة الإعلانات. قد يُطلب منك
            إرسال معلومات معينة من خلال مزود خدمة تابع لأطراف ثالثة لشراء إعلان مميز، بما في ذلك على سبيل المثال لا
            الحصر، خدمة الدفع التابعة لأطراف ثالثة التي قد تخضع لشروط الاستخدام الخاصة بها ولسياسات أخرى. لا تقوم mwz3
            بأي تمثيل أو ضمان فيما يتعلق بسلامة أو أمان المعلومات المرسلة إلى أي مزود خدمة تابع لأطراف ثالثة. كما يكون
            رابطك بأي خدمة تابع لأطراف ثالثة على مسؤوليتك الخاصة تمامًا، وترفع mwz3 عنها اية مسؤولية المتعلقة بذلك.
          </p>
          <p>تخضع الإعلانات المميزة للشروط المدرجة أدناه، بالإضافة إلى شروط الخدمة الإضافية.</p>
        </li>
        <li>
          <Text fz='h2' fw={700}>
            4.السلوكيات
          </Text>
          <p>
            إنك توافق على عدم وضع أية معلومات على الموقع أو استضافتها او عرضها او تحميلها او تغييرها او نشرها او نقلها
            او تحديثها او مشاركتها أو جعل المحتوى متاحًا في الحالات التالية:
          </p>
          <List withPadding className='list-disc'>
            <ListItem>انتهاك أي قانون أو قواعد قانونية؛</ListItem>
            <ListItem>
              تكون ذات حقوق الطبع والنشر وبراءات الاختراع محمية بواسطة الأسرار التجارية أو العلامات التجارية، بما في ذلك
              الخصوصية وحقوق الدعاية، أو تخضع لملكية فكرية أخرى أو حقوق الملكية التابعة لطرف ثالث، بما في ذلك الخصوصية
              وحقوق الدعاية ما لم تكن مالك هذه الحقوق أو تم حصولك على إذن أو ترخيص من المالك الشرعي لنشر المواد ومنح
              mwz3 جميع حقوق الترخيص الممنوحة ههنا؛
            </ListItem>
            <ListItem>
              انتهاك أية من حقوق الملكية الفكرية السابقة لأي طرف أو المحتوى الذي ليس لديك الحق في عرضه بموجب أي قانون او
              قواعد قانونية او العلاقة (العلاقات) التعاقدية أو الائتمانية؛
            </ListItem>
            <ListItem>
              الحالات الضارة، المسيئة، الغير القانونية، التهديد، التحرش، التجديف، التشهير، الفاضحة، الإباحية، التحرش
              الجنسي بالأطفال، التشهير، اقتحام خصوصية الآخرين أو غيرها من الحقوق، الكراهية، أو العرقية، محل الاعتراض
              العرقي، الاستخفاف، تتعلق أو تشجع على غسيل الأموال أو القمار الغير الشرعي أو الأضرار غير القانونية أو ما
              يمكن أن يضر بالقاصرين بأي شكل من الأشكال أو بطريقة أخرى غير قانونية بأي طريقة كانت؛
            </ListItem>
            <ListItem>
              الحالات التي تضايق، تحط من القيم، الترهيب، أو الحض على الكراهية تجاه أي فرد أو مجموعة من الأفراد على أساس
              الدين أو الجنس أو التوجه الجنسي أو العرق أو السن أو الإعاقة؛
            </ListItem>
            <ListItem>
              الحالات التي تنتهك أية قوانين توظيف (محلية) متساوية، بما في ذلك على سبيل المثال لا الحصر تلك التي تحظر
              التصريح، الحالات التي تحظر على ذكر أي إعلان عن العمل، أو الافضلية أو الشرط على أساس العرق أو اللون أو
              الدين أو الجنس أو الأصل القومي أو السن أو إعاقة مقدم الطلب.
            </ListItem>
            <ListItem>الحالات التي تتضمن معلومات شخصية أو تعريفية عن شخص آخر دون موافقة صريحة من ذلك الشخص؛</ListItem>
            <ListItem>
              الحالات التي تنتحل شخصية أي شخص أو كيان بما في ذلك، على سبيل المثال لا الحصر، لموظف mwz3 او زعم التزوير أو
              بطريقة أخرى تشوه الانتماء إلى شخص أو كيان؛
            </ListItem>
            <ListItem>
              خداع أو تضليل المرسل إليه حول أصل هذه الرسائل أو إيصال أية معلومات مهينة أو تهديدية بطبيعتها؛
            </ListItem>
            <ListItem>
              المعلومات الخاطئة أو الخادعة أو المضللة أو المخادعة أو المراوغة أو تشكل عرضا&quot; &quot;لأشكال الاحتيال&quot;
            </ListItem>
            <ListItem>
              الحالات التي تشكل أو تحتوي على &quot;التسويق الشبكي&quot;، &quot;التسويق المتعدد المستويات&quot;، &quot;مخططات سلسلة بونزي والتسويق
              الهرمي&quot; ، &quot;التسويق التابع ،&quot; &quot;رابط رمز الإحالة ،&quot; &quot;البريد غير المرغوب فيه&quot; ، &quot;البريد المؤذي&quot; ، &quot;الرسائل
              المتسلسلة&quot; أو الإعلانات غير المرغوب فيها ذات الطبيعة التجارية؛
            </ListItem>
            <ListItem>
              الحالات التي تشكل أو تحتوي على أي شكل من أشكال الإعلان أو الالتماس في حال: (1) وضعها في مناطق أو فئات من
              الموقع لم يتم تخصيصها لهذه الأغراض او (2) إرسالها بالبريد الإلكتروني إلى مستخدمي mwz3 الذين طلبوا عدم
              الاتصال بهم بشأن الخدمات الأخرى، المنتجات أو المصالح التجارية؛
            </ListItem>
            <ListItem>تتضمن روابط الخدمات التجارية أو مواقع الأطراف الثالثة باستثناء ما يسمح به mwz3 تحديدًا؛</ListItem>
            <ListItem>
              الحالات التي تعلن عن أية خدمات غير قانونية أو بيع أي سلع محظورة أو محظور بيعها بموجب القانون المعمول به،
              بما في ذلك على سبيل المثال لا الحصر البنود التي يحظر بيعها أو منظمة بموجب قانون الولاية القضائية المحلية
              المعمول به؛
            </ListItem>
            <ListItem>
              الحالات التي تحتوي على فيروسات البرامج أو أي رمز كمبيوتر آخر، ملفات أو برامج مصممة للمقاطعة، تدمير أو
              تقييد وظيفة أي برنامج حاسوب أو أجهزة أو معدات اتصالات أو أي مورد حاسوب آخر؛
            </ListItem>
            <ListItem>
              الحالات التي تعطل التدفق الطبيعي للحوار مع عدد مفرط من الرسائل (هجوم السيل) الى الخدمة، أو تؤثر بشكل سلبي
              على قدرة المستخدمين الآخرين على استخدام الخدمة؛ أو
            </ListItem>
            <ListItem>
              الحالات التي تستخدم عناوين بريد إلكتروني المضللة، أو العناوين المزورة أو المعرّفات التي تم التلاعب بها
              بهدف إخفاء أصل المحتوى الذي يتم إرساله عبر الخدمة.
            </ListItem>
          </List>
          <p>بالإضافة إلى ذلك، فإنك توافق على عدم:</p>
          <List withPadding className='list-disc'>
            <ListItem>
              الاتصال بأي شخص قد طلب عدم الاتصال به، أو إجراء اتصال غير مرغوب فيه مع أي شخص لأي غرض تجاري، على وجه
              التحديد، الاتصال بأي مستخدم لنشر الإعلان على الموقع الالكتروني لأطراف ثالثة أو وضع أي إعلان نيابة عن هذا
              المستخدم؛ أو &quot;مطاردة&quot; أو مضايقة أي شخص؛
            </ListItem>
            <ListItem>إجراء أية تعليقات أو مشاركات تشهيرية أو افترائية على أو ضد أي شخص؛</ListItem>
            <ListItem>جمع البيانات الشخصية عن المستخدمين أو الكيانات الأخرى لأغراض تجارية أو غير قانونية؛</ListItem>
            <ListItem>
              استخدام الوسائل الآلية، بما في ذلك العناكب، والروبوتات، الزواحف، أدوات استخراج البيانات أو ما شابه للتنزيل
              أو كشط البيانات من الخدمة باستثناء محركات البحث على الإنترنت (على سبيل المثال، Google) والأرشيفات العامة
              غير التجارية (على سبيل المثال org) والتي تتوافق مع ملف robots.txt file الخاص بنا؛
            </ListItem>
            <ListItem>
              وضع المحتوى خارج المنطقة المحلية أو غير ذات صلة بالمنطقة المحلية، وضع المحتوى بشكل متكرر أو مشابه أو فرض
              أحمال كبيرة غير معقولة أو غير متناسبة على خوادمنا والبنى التحتية الأخرى؛
            </ListItem>
            <ListItem>
              وضع نفس المادة أو الخدمة في فئات أو منتديات تصنيفية متعددة أو في مناطق متعددة من العاصمة؛
            </ListItem>
            <ListItem>
              محاولة الوصول غير المصرح به إلى أنظمة الكمبيوتر التي تملكها أو تتحكم فيها mwz3 أو الانخراط في أي نشاط
              يعطل، او يقلل من جودة mwz3 ويتعارض مع الأداء أو يعوق وظيفة الخدمة أو الموقع الإلكتروني.
            </ListItem>
            <ListItem>
              استخدام أي شكل من أشكال الجهاز الآلي أو برنامج الحاسوب (يشار إليها أحيانًا باسم &quot;أدوات التأشير&quot;) التي تمكن
              من استخدام &quot;نظام التأشير&quot; الخاص بـ mwz3 أو غيرها من أنظمة التحكم المجتمعية بدون إدخال كل علامة يدويًا
              بواسطة تدخل بشري الذي يبدأ بالإشارة (&quot;جهاز التأشير الآلي&quot;) أو استخدام أية أداة من هذا القبيل لإزالة
              اعلانات المنافسين وأطراف ثالثة أخرى أو إزالة الاعلانات دون حسن نية معقولة بأن الاعلان التي يتم التأشير عنه
              ينتهك هذه الشروط أو أي قانون أو قاعدة قانونية معمول بها.
            </ListItem>
            <ListItem>
              استخدام أي جهاز أو برنامج آلي يمكّن من إرسال النشرات التلقائية على mwz3 دون تدخل بشري أو التأليف (&quot;جهاز
              نشر تلقائي)، بما في ذلك على سبيل المثال لا الحصر، استخدام أي جهاز نشر آلي فيما يتعلق بالترحيلات المجمّعة
              أو لتقديم الترحيل التلقائي في أوقات أو فترات محددة؛ أو
            </ListItem>
          </List>
          <p>
            يخضع أي محتوى يتم تحميله للقوانين ذات الصلة. كما قد يتم تعطيله و / أو قد يخضع للتحقيق بموجب القوانين
            المناسبة. علاوة على ذلك، إذا تبين أنك في حالة عدم امتثال للقوانين وللقواعد القانونية وهذه الشروط، أو سياسة
            الخصوصية للموقع، يجوز لنا إنهاء حسابك / حظر دخولك إلى الموقع ونحن نحتفظ بالحق في إزالة أي محتوى غير متوافق
            تم تحميله بواسطتك.
          </p>
        </li>
        <li>
          <Text fz='h2' fw={700}>
            5.المنشورات المدفوعة
          </Text>
          <p>
            قد تتقاضى mwz3 رسومًا لنشر المحتوى في بعض مناطق الخدمة. تسمح الرسوم بنشر محتوى معين في منطقة معينة من
            الموقع. يكون كل طرف واضعا&quot; محتوى على الخدمة مسؤولاً عن المحتوى المذكور ويكون مسؤولا&quot; عن الالتزام بالشروط.
            تكون أية رسوم من هذا القبيل بموجب هذه الاتفاقية غير قابلة للاسترداد في حال تمت إزالة أي محتوى من الخدمة بسبب
            مخالفة هذه الشروط. سيتم ذكر الشروط الإضافية المتعلقة بالمحتوى المدفوع بالكامل في القسم (الأقسام) المعمول به.
          </p>
        </li>
        <li>
          <Text fz='h2' fw={700}>
            6. وكلاء النشر
          </Text>
          <p>
            يشير المصطلح &quot;وكيل النشر&quot; إلى وكيل طرف ثالث او الخدمة أو الوسيط الذي يتقدم لنشر المحتوى على الخدمة نيابة عن
            الآخرين. تحظر mwz3، استخدام وكلاء النشر بصورة مباشرة او غير مباشرة بدون الموافقة الخطية الصريحة من mwz3.
            بالإضافة إلى ذلك، لا يُسمح لوكلاء النشر بوضع المحتوى نيابةً عن الآخرين، بشكل مباشر أو غير مباشر أو الدخول
            إلى الخدمة من أجل نشر المحتوى بالنيابة عن الآخرين، باستثناء الحصول على موافقة خطية صريحة أو ترخيص من mwz3.
          </p>
        </li>
        <li>
          <Text fz='h2' fw={700}>
            7.الترخيص للدخول إلى الخدمة
          </Text>
          <p>
            تمنحك mwz3 ترخيصًا محدودًا وقابلًا للإلغاء وغير حصري للدخول إلى الخدمة واستعمالها للاستخدام الشخصي: لا يشمل
            هذا الترخيص الممنوح هنا أي ما يلي: (أ) الدخول أو استخدام الخدمة عن طريق وكلاء النشر؛ أو (ب) جمع أو تجميع أو
            نسخ أو تكرار أو إعادة إنتاج أو عرض أو استخدام مشتق للخدمة ولا حتى استخدام استخراج البيانات، والروبوتات،
            والعناكب أو أدوات مماثلة لجمع البيانات واستخراجها لأي غرض من الأغراض، ما لم تسمح به mwz3بشكل صريح أو كما هو
            منصوص عليه في هذه الشروط. ورغم ما سبق، ان محركات البحث على الإنترنت للأغراض العامة والأرشيفات العامة غير
            التجارية التي تجمع المعلومات لغرض وحيد هو عرض الروابط التشعبية للخدمة، شريطة أن يقوم كل منها بذلك من خلال
            عنوان IP ثابت أو مجموعة من عناوين IP باستخدام وكيل يمكن التعرف عليه بسهولة والتوافق مع ملف robots.txt لدينا
            وفي هذه الحالات يتم السماح بالمشاركة في النشاطات المنصوص عليها في (ب). لأغراض هذا الاستثناء، لا يتضمن &quot;محرك
            بحث على الإنترنت للأغراض العامة&quot; موقعا&quot; الكترونيا&quot; او محرك للبحث أو غيرها من الخدمات التي تتخصص في القوائم
            المبوبة بما في ذلك أية مجموعة فرعية من قوائم الإعلانات المبوبة مثل السكن، للبيع، وظائف، خدمات او شخصيات، أو
            خلافا&quot; لذلك تلك التي توفر خدمات قائمة على الإعلانات المبوبة. يسمح لك الترخيص المنصوص عليه في هذا القسم بعرضه
            على الموقع الالكتروني الخاص بك، أو إنشاء رابط تشعبي له، والمنشورات الفردية على الخدمة طالما أن هذا الاستخدام
            هو لأغراض غير تجارية و / أو لأغراض الإبلاغ الصحفي فقط. (على سبيل المثال، لاستخدامها في المدونات الشخصية أو
            غيرها من الوسائل الاعلام الشخصية عبر الإنترنت). إذا كان العدد الإجمالي لمثل هذه الإعلانات المعروضة على
            الموقع الالكتروني الخاص بك أو المرتبطة به يتجاوز تسعة وتسعين (99) منشورة، يعتبر استخدامك انتهاكا&quot; لهذه
            الشروط، ما لم تمنحك mwz3 صراحةً إذنًا بخلاف ذلك. يكون مسموحا&quot; لك أيضًا بخلق رابط تشعبي إلى الصفحة الرئيسية
            للموقع الالكتروني طالما لا يصور الرابط mwz3، موظفيه، الشركات التابعة أو الوكلاء بحالة خاطئة أو مربكة أو
            مضللة أو مهينة أو غير ذلك. قد تقدم mwz3أجزاء من خدمة تنسيق RSS، لغرض دمج تغذية RSS الفردية في موقع شخصي أو
            مدونة أو عرض منشورات من خلال تجميع أخبار برامج الطرف الثالث. تسمح لك mwz3 بعرض أية خلاصات RSS على الموقع
            الالكتروني الخاص بك، واستخراجها وربطها إلى أي من هذه الخلاصات RSS على موقعك الالكتروني الشخصي أو مدونتك
            شخصية، بشرط ( أ ) ان يكون استخدامك لخلاصة RSS هو فقط لأغراض شخصية غير تجارية، (ب) ربط كل عنوان ضمن خلاصة RSS
            بشكل صحيح بالوضعية الأصلية على الخدمة ويعيد توجيه المستخدم إلى وضعية النشر عندما ينقر المستخدم عليه (ت) تقدم
            بطريقة واضحة ، الإسناد الصحيح إلى &quot;mwz3&quot; كمصدر لخلاصة RSS (ث) لا يشير استخدامك أو عرضك لخلاصة RSS إلى أن
            mwz3 تروج أو تؤيد أية أسباب خاصة بطرف ثالث، او الآراء او الأفكار او المواقع الالكترونية أو المنتجات أو
            الخدمات (ج) لا تقوم بإعادة توزيع خلاصة RSS . (ح) ولا يثقل استخدامك أو يبطئ في أداء أنظمة mwz3 . تحتفظ mwz3
            بجميع الحقوق المضمنة في أية من خلاصات RSS المقدمة من خلال الخدمة وأي محتوى منها، وقد تنهي mwz3 أية خدمة RSS
            في أي وقت دون إشعار مسبق. ان استخدام الخدمة خارج نطاق الوصول المصرح به على النحو المنصوص عليه في هذه الشروط
            ينهي على الفور أي إذن أو ترخيص ممنوح ههنا. يجب عليك أولاً الحصول على ترخيص من mwz3 من أجل تجميع الخدمة أو
            نسخها أو تكرارها أو عرضها أو استخدامها بطريقة اشتقاقية او أي محتوى يتم توفيره عبر الخدمة لأغراض أخرى (بما في
            ذلك الأغراض التجارية).
          </p>
        </li>
        <li>
          <Text fz='h2' fw={700}>
            8. اشعار بالانتهاكات
          </Text>
          <p>
            لا تتحمل mwz3 مسؤولية أي انتهاك لحقوق الطبع والنشر أو غيرها من حقوق الملكية الفكرية، الناشئة عن المواد
            المنشورة أو المنقولة من خلال الموقع الالكتروني او مواد معلن عنها على الموقع الالكتروني من قبل المستخدمين
            النهائيين أو أية أطراف ثالثة أخرى.
          </p>
          <p>
            إذا كنت مالكًا للحقوق الملكية الفكرية أو وكيلا مرخّصاً له بالكامل للتصرف بالنيابة عن مالك حقوق الملكية
            الفكرية وإنك تعتقد أن أي محتوى أو محتوى آخر ينتهك حقوق الملكية الفكرية الخاصة بك أو حقوق الملكية الفكرية
            للمالك الذي فوضك بالتصرف نيابة عنه، عندها يمكنك إرسال إشعار الى موزع لحذف المحتوى ذات الصلة بحسن نية. يجب أن
            يحتوي الإشعار والطلب على المعلومات التالية
          </p>
          <List withPadding className='list-disc'>
            <ListItem>
              توقيع فعلي أو إلكتروني لشخص مرخص له بالتصرف نيابة عن مالك الحق الحصري المزعوم انتهاك حقوقه؛
            </ListItem>
            <ListItem>
              تحديد حقوق الملكية الفكرية المزعوم أنها تعرضت للانتهاك أو، إذا كان هناك عدة حقوق ملكية فكرية في موقع واحد
              على الإنترنت مشمولة بإشعار واحد، عندها يجب تقديم قائمة تمثل هذه الأعمال على هذا الموقع؛
            </ListItem>
            <ListItem>
              تحديد المحتوى (عن طريق رابط البيانات أو الاتصال، AD ID، الخ) الذي يُزعم أنه منتهك او خاضع لنشاط انتهاك،
              فيجب إزالته أو تعطيل الدخول إليه وتكون المعلومات كافية بشكل معقول للسماح لـ mwz3 بتحديد موقع المادة؛
            </ListItem>
            <ListItem>
              المعلومات الكافية بشكل معقول للسماح لـ mwz3 بالاتصال بك مثل عنوان ورقم هاتف وعنوان بريد إلكتروني، إذا كان
              متاحًا؛
            </ListItem>
            <ListItem>
              بيان موّقع على أنك تعتقد بحسن نية أن استخدام المادة بالطريقة المشكوك فيها هو غير مصرح به من قبل مالك حقوق
              الملكية الفكرية أو وكيله أو القانون؛
            </ListItem>
            <ListItem>
              بيان موّقع يفيد بأن مالك الملكية الفكرية يبقي mwz3 بعيدة عن أية مطالبة من أي طرف ثالث فيما يتعلق بإزالة
              mwz3 للمحتوى ذي الصلة؛ و
            </ListItem>
            <ListItem>
              بيان موّقع على أن المعلومات الواردة في الإشعار هي دقيقة وتحت طائلة عقوبة شهادة الزور، وأنك مفوض للتصرف
              نيابة عن مالك الحق الحصري الذي يُزعم أنه تم انتهاك حقوقه.
            </ListItem>
            <ListItem>يجب إرسال الإشعارات إلى اي ام بي جي مصر من خلال قسم المساعدة</ListItem>
          </List>
        </li>
        <li>
          <Text fz='h2' fw={700}>
            9. حقوق الملكية الفكرية
          </Text>
          <p>
            انك تقر وتوافق على أن المواد الموجودة على الموقع الالكتروني (بخلاف محتوى المستخدم الذي قمت بترخيصه لـ mwz3
            بموجب القسم 2 (3) من الشروط)، بما في ذلك على سبيل المثال لا الحصر، النصوص، البرامج، الكتابات، الرسومات،
            الصور، الأصوات، الموسيقى والفيديو ، والميزات التفاعلية وما شابه (&quot;المواد&quot;) والعلامات التجارية، علامات الخدمة
            والشعارات الموجودة بها (&quot;العلامات&quot;)، هي مملوكة أو مرخصة لـ mwz3 وتخضع لحقوق الطبع والنشر وحقوق الملكية
            الفكرية الأخرى بموجب القوانين المصرية والمعاهدات الدولية و / أو الاتفاقيات الدولية. قد يعرض الموقع
            الالكتروني بعض العلامات التجارية التي تنتمي إلى أطراف ثالثة فيما يتعلق بالخدمات. قد يخضع استخدام هذه
            العلامات التجارية للترخيص الممنوح من قبل أطراف ثالثة لـ mwz3 . يتوجب عليك، في أي حال من الاحوال الا تقوم
            بالهندسة العكسية أو فك أو تفكيك هذه العلامات التجارية. لا يجوز تفسير أي شيء في هذه الوثيقة كانه منحكم لهذه
            العلامات التجارية. يتم توفير المواد على الموقع الالكتروني الخاص بك AS IS لمعلوماتك واستخدامك الشخصي فقط. ولا
            يجوز استخدامها أو نسخها أو إعادة إنتاجها أو توزيعها او نقلها او بثها او عرضها او بيعها او ترخيصها أو
            استغلالها لأي غرض آخر من دون الحصول على موافقة خطية مسبقة من المالكين المعنيين. تحتفظ mwz3 بجميع الحقوق
            الغير الممنوحة صراحةً في هذا الموقع والمواد. أنك توافق على عدم الانخراط في استخدام أو إعادة انتاج أو توزيع
            أي من المواد بخلاف ما هو مسموح به صراحة هنا بما في ذلك أي استخدام أو نسخ أو توزيع لمواد أطراف ثالثة تم
            الحصول عليها من خلال الموقع لأي أغراض تجارية. في حال قمت بتنزيل أو طباعة نسخة من المواد للاستخدام الشخصي،
            يتوجب عليك الاحتفاظ بجميع حقوق الطبع النشر وإشعارات الملكية الأخرى الواردة فيه. إنك توافق على عدم التحايل أو
            تعطيل ميزات الأمان المتعلقة بالموقع أو ميزات تمنع أو تقيد استخدام أو نسخ أي من المواد أو فرض قيود على
            استخدام الموقع أو المواد الموجودة فيه. تكون الخدمة محمية إلى أقصى الحد المسموح به بموجب قوانين حقوق النشر
            وغيرها من القوانين المصرية والمعاهدات الدولية و / أو الاتفاقيات الدولية. كما يكون المحتوى الذي يتم عرضه في
            الخدمة أو من خلالها محمي بموجب حقوق الطبع والنشر بما في ذلك على سبيل المثال لا الحصر، العمل الأدبي، عمل
            جماعي و / أو تجميع وفقا لقوانين حقوق الطبع النشر وغيرها من القوانين المصرية والمعاهدات الدولية و / أو
            الاتفاقيات الدولية.
          </p>
          <p>
            ان أي استنساخ أو تعديل أو خلق أعمال مشتقة من أو إعادة توزيع الموقع، المواد، أو العمل الجماعي أو التجميع، أو
            السماح للآخرين بالقيام بذلك يكون محظور صراحة. يحظر صراحةً نسخ أو إعادة إنتاج الموقع أو المواد أو أي جزء منها
            إلى أي خادم أو موقع آخر لإعادة الانتاج أو إعادة التوزيع. كما إنك توافق أيضًا على عدم إعادة إنتاج أو تكرار أو
            نسخ المحتوى أو المواد من الخدمة وتوافق على الالتزام بجميع إشعارات حقوق الطبع والنشر والإشعارات الأخرى
            المعروضة على الخدمة. لا يجوز لك فك أو تفكيك الهندسة العكسية، أو محاولة اكتشاف أي شفرة مصدر موجودة في الخدمة.
            ودون تقييد لما سبق، فإنك توافق على عدم إعادة إنتاج أو تكرار أو نسخ أو بيع أو إعادة بيع أو استغلال لأي من
            الاغراض التجارية، لأي جانب من جوانب الخدمة. mwz3 هي علامة خدمة مسجلة لدى مكتب براءات الاختراع والعلامات
            التجارية في الولايات المتحدة وسلطات البراءات والعلامات التجارية على مستوى الاتحاد الأوروبي وفي مختلف
            الولايات القضائية الأخرى بما في ذلك مصر.
          </p>
        </li>
        <li>
          <Text fz='h2' fw={700}>
            10. تقارير المستخدم
          </Text>
          <p>
            إنك تدرك أنه عند استخدام الموقع الالكتروني، ستتعرض لمحتوى من مجموعة متنوعة من المصادر ولا تتحمل mwz3 اية
            مسؤولية عن دقة أو فائدة أو سلامة أو حقوق الملكية الفكرية المتعلقة بهذا المحتوى أو المرتبطة به. كما إنك توافق
            وتتحمل كل المسؤولية عن استخدامك هذا. وإنك تفهم وتقرّ أكثر بأنك قد تتعرض لمحتوى غير دقيق، هجومي، أو غير لائق
            أو غير مرغوب فيه أو افترائي او تشهيري وتوافق على التنازل عن أية حقوق أو تعويضات قانونية أو منصفة تتنازل عنها
            أو قد تكون ضد شركة mwz3 فيما يتعلق بذلك.
          </p>
        </li>
        <li>
          <Text fz='h2' fw={700}>
            11. التعويضات
          </Text>
          <p>
            انك توافق على الدفاع والتعويض لشركة mwz3 وابقائها بعيدة عن اية مسؤولية، والشركات التابعة والمنتسبة لها
            والخلفاء، والمتنازلين، والمديرين، والموظفين، والوكلاء، ومقدمي الخدمات، والموردين، والموظفين ضد أية وجميع
            المطالبات، الأضرار ، والالتزامات، والخسائر، والمسؤوليات التكاليف أو الديون والنفقات (بما في ذلك على سبيل
            المثال لا الحصر أتعاب المحاماة)، الناشئة عن: (i) استخدامك ودخولك إلى الموقع و/أو الخدمة ؛(ii) انتهاكك لأي
            بند من هذه الشروط ؛(iii) انتهاكك لأي حق من حقوق الطرف الثالث؛ بما في ذلك على سبيل المثال لا الحصر أية حقوق
            الطبع النشر والعلامات التجارية وحقوق الملكية الفكرية الأخرى، السرية التجارية أو حقوق الملكية أو الملكية
            الخاصة؛ أو (iv) أي ادعاء بأن المحتوى الخاص بك تسبب في ضرر لطرف ثالث. ان التزام الدفاع والتعويض هذا سيبقى
            قائما&quot; لجهة إنهاء أو تعديل أو انتهاء صلاحية هذه الشروط واستخدامك للخدمة والموقع الالكتروني.
          </p>
        </li>
        <li>
          <Text fz='h2' fw={700}>
            12. سياسة منع البريد المؤذي spam
          </Text>
          <p>
            إنك تدرك وتوافق على أن إرسال بريد إلكتروني غير مرغوب فيه للإعلانات أو اتصالات أخرى غير مرغوب فيها إلى عناوين
            البريد الإلكتروني في mwz3 أو من خلال أنظمة كمبيوتر mwz3 يكون ممنوع صراحة بموجب هذه الشروط وبموجب القانون
            المصري. كما إنك تقر وتوافق على أنه من وقت لآخر، قد تقوم mwz3 بمراقبة استخدام البريد الإلكتروني باستخدام
            أجهزة المراقبة البشرية أو برنامج آلي للإبلاغ عن كلمات معينة مرتبطة بالرسائل الغير مرغوب فيها أو الحيل في
            رسائل البريد الإلكتروني التي يتم إرسالها بين مستخدم إلى آخر في نظام البريد الإلكتروني mwz3 . لا يجوز استخدام
            أي اتصال بينك وبين أي مستخدم آخر يستعمل ميزات الاتصال المتوفرة على الخدمة والموقع الإلكتروني إلا وفقًا لهذه
            البنود. يعتبر أي استخدام غير مصرح به لأنظمة كمبيوتر mwz3 انتهاكًا لهذه الشروط. وقد تعرض مثل هذه الانتهاكات
            المرسل ووكلائه لمسؤوليات وعقوبات مدنية وجنائية.
          </p>
        </li>
        <li>
          <Text fz='h2' fw={700}>
            13. التعامل مع المنظمات والأفراد
          </Text>
          <p>
            إنك تقر وتوافق على أن mwz3 لن تكون مسؤولة عن علاقاتك مع أية منظمات و/أو أفراد على الموقع الإلكتروني أو من
            خلال الخدمة. وهذا يشمل على سبيل المثال لا الحصر، تسديد ثمن السلع، وتسليمها والخدمات وأية شروط أو ضمانات أو
            إقرارات أخرى مرتبطة بأي تفاعل قد يكون لديك مع منظمات و/أو أفراد آخرين.
          </p>
          <p>
            يكون هذا التعامل بينك وبين هذه المنظمات و / أو الأفراد محصورا&quot; بكم فقط. إنك توافق وتقر بأن mwz3 لن تكون
            مسؤولة أو عرضة لأي خسارة أو ضرر من أي نوع يحدث نتيجة لأي تعامل أو تفاعلات من هذا القبيل. في حال نشوء نزاع
            بين المشاركين على الموقع أو بين المستخدمين وأي طرف ثالث، فإنك تدرك وتوافق على أن mwz3 ليست ملزمة بالتورط في
            مثل هذا النزاع. في حال نشوء نزاع مع واحد أو أكثر من المستخدمين الآخرين، فإنك تبرئ mwz3 ومسؤوليها والموظفين
            والوكلاء والخلفاء من أي وجميع المطالبات والادعاءات والأضرار (الفعلية واللاحقة) من كل نوع أو طبيعة، معروفة أو
            غير معروفة، مشتبه او غير مشتبه بها، تم او لم يتم الكشف عنها، والتي تنشأ بأي شكل من الأشكال والمتعلقة بمثل
            هذه النزاعات و / أو خدمتنا.
          </p>
        </li>
        <li>
          <Text fz='h2' fw={700}>
            14. تقييد وإنهاء الخدمة
          </Text>
          <p>
            إنك تقر وتوافق على أن mwz3 قد تضع حدودًا من وقت لآخر فيما يتعلق باستخدام الخدمة، بما في ذلك من بين أمور
            أخرى، الحد الأقصى لعدد الأيام التي سيتم فيها الاحتفاظ بالمحتوى أو الاحتفاظ به بواسطة الخدمة، الحد الأقصى
            لعدد وحجم المنشورات، رسائل البريد الإلكتروني أو أي محتوى آخر قد يتم نقله أو تخزينه بواسطة الخدمة والتردد
            الذي يمكنك من خلاله الدخول إلى الخدمة أو الموقع الإلكتروني. إنك تقر وتوافق على أن mwz3 لا تتحمل أية مسؤولية
            أو التزام تجاه الحذف أو الإخفاق في تخزين أي محتوى يحتفظ به أو ينقله الموقع أو الخدمة. إنك تقر وتوافق على أن
            mwz3 تحتفظ بالحق في تعديل أو إيقاف الخدمة في أي وقت من الأوقات (أو أي جزء منها) مع أو بدون اشعار. لن تكون
            mwz3 مسؤولة تجاهك أو تجاه أي طرف ثالث عن أي تعديل او تعليق أو وقف الخدمة من هذا القبيل. إنك تقر وتوافق على
            أن mwz3 ، وفقًا لتقديرها الخاص والمطلق، تتمتع بالحق (ولكن ليس الالتزام) بحذف أو إلغاء تفعيل حسابك، حظر بريدك
            الإلكتروني أو عنوان IP الخاص بك، أو إنهاء دخولك إلى الخدمة أو استخدامها (أو أي جزء منها) على الفور ودون سابق
            إنذار، وإزالة أي محتوى داخل الخدمة وتجاهله لأي سبب أو بدون سبب على الإطلاق، بما في ذلك، على سبيل المثال لا
            الحصر، إذا اعتقدت شركة mwz3 أنك انتهكت هذه الشروط. علاوة على ذلك، إنك توافق على أن mwz3 لن تكون مسؤولة تجاهك
            أو تجاه أي طرف ثالث عن أي إنهاء دخولك إلى الموقع أو الخدمة. بالإضافة الى ذلك، فإنك توافق على عدم محاولة
            استخدام الخدمة بعد أي إنهاء من هذا القبيل.
          </p>
        </li>
        <li>
          <Text fz='h2' fw={700}>
            15. التنازل عن الضمانات
          </Text>
          <p>
            إنك تقر وتوافق صراحة على أن استخدام الموقع والخدمة بشكل كامل يكون على مسؤوليتك الخاصة. وأن الموقع الالكتروني
            والخدمة مقدمة على اساس &quot;كما هي&quot; أو &quot;حسب التوفر&quot;، دون أية ضمانات من أي نوع كانت. ان جميع الضمانات الصريحة
            والضمنية، بما في ذلك، على سبيل المثال لا الحصر، ضمانات الرواج، الملاءمة لغرض معين، وعدم الإخلال بحقوق
            الملكية يتم التنازل عنه صراحةً وفقا&quot; لأقصى حد يحدده القانون. وإلى أقصى حد يسمح به القانون، تبرئ mwz3 كل من
            مسؤوليها، والمديرين والموظفين والوكلاء عن جميع الضمانات الصريحة أو الضمنية فيما يتعلق بالموقع الالكتروني
            الخاص بك واستخدامك له. لا تقدم شركة mwz3 أية ضمانات أو تأكيدات حول دقة أو اكتمال محتوى الموقع أو محتوى
            المواقع الالكترونية الخاصة بأطراف ثالثة المرتبطة بالموقع. لا تتحمل mwz3 أية مسؤولية أو عرضة عن أي (I) أخطاء
            أو عدم دقة المحتوى (II) إصابة الاشخاص أو أضرار في الممتلكات من أي نوع كانت نتيجة دخولك واستخدامك للموقع
            الإلكتروني والخدمة، (III) أي دخول غير مصرح به أو استخدام خوادمناservers و/ أو أية وجميع المعلومات الشخصية
            و/أو المعلومات المالية المخزنة فيه، (IV) أي انقطاع أو توقف عن الإرسال من والى الموقع(IV) أي تجميع، فيروسات،
            TROJAN HORSES أو ما قد يتم نقلها عن طريق أي طرف ثالث و/أو (V) أية أخطاء أو سهو في أي محتوى أو أية خسائر أو
            أضرار من أي نوع كانت نتيجة لاستخدام أي محتوى النشر، الرسائل الالكترونية، أو المراسلة أو النقل أو غير ذلك من
            الخدمات المتاحة عبر الموقع الالكتروني أو الخدمة. لا تضمن mwz3 ولا تجيز ولا تكفل أو تتحمل مسؤولية أي منتج أو
            خدمة تم نشرها أو عرضها من قبل طرف ثالث من خلال الموقع الإلكتروني أو أي موقع على شبكة الإنترنت أو المميز في
            أي شعار أو إعلانات أخرى ولن تكون mwz3 طرفًا أو بأية طريقة مسؤولة لرصد أية معاملات بينك وبين و/أو مستخدمين
            آخرين و/أو مزودي منتجات أو خدمات أطراف ثالثة او الخدمات. عند شراء منتج أو خدمة من خلال أي وسيط أو في أية
            بيئة، يتوجب عليك استخدام أفضل حكم لك واخذ الحيطة والحذر عند الحاجة.
          </p>
        </li>
        <li>
          <Text fz='h2' fw={700}>
            16. حدّ المسؤولية
          </Text>
          <p>
            لا يجوز بأي حال من الأحوال لشركة mwz3 أو مسؤوليها أو مدراءها أو موظفيها أو وكلائها أن تكون مسؤولة عن اية
            اضرار بشكل مباشر او غير مباشر أو بشكل عرضي أو خاص أو تبعي أو نموذجي (حتى لو تم إبلاغ mwz3 بإمكانية حدوث مثل
            هذه الأضرار)، ناتجة بأي شكل من الاشكال عن استخدامك للموقع الالكتروني أو الخدمة، بما في ذلك على سبيل المثال
            لا الحصر الأضرار الناجمة عن استخدام أو إساءة استخدام الموقع أو الخدمة، او من عدم القدرة على استخدام الموقع
            أو الخدمة، او من خلال التوقف أو التعليق أو التعديل أو تبديل أو إنهاء الموقع أو الخدمة. كما ينطبق هذا الحد من
            المسؤولية على الأضرار الناجمة عن الخدمات أو المنتجات الأخرى التي تم تلقيها أو الإعلان عنها في الموقع أو
            الخدمة أو أي رابط على الموقع وكذلك بسبب أية معلومات، او قرارات أو آراء التي تم تلقيها من خلال الإعلان على
            الموقع الالكتروني أو الخدمة أو أي رابط على موقع mwz3 . تسري هذه القيود على أقصى حد يسمح به القانون. إنك تقر
            وتوافق على وجه التحديد أن mwz3 لن تكون مسؤولة عن تقديمات المستخدم أو الافتراض، التشهير، السلوك العدواني أو
            الغير القانوني لأي مستخدم أو طرف ثالث، وإنك تتحمل وحدك مخاطر الأذى أو الضرر عن كل ما سبق.
          </p>
          <p>
            ان الموقع الالكتروني هو مقدم من قبل mwz3 ويتحكم mwz3 به. لا تقدم mwz3 أية إقرارات أو ضمانات بأن الموقع
            الالكتروني يتناسب لاستخدامه في مواقع أخرى. أولئك الذين يدخلون او يستخدمون الموقع الالكتروني من ولايات قضائية
            أخرى يقومون بذلك بمحض إرادتهم وتحت مسؤولية المخاطرة خاصتهم. كما انهم يمتثلون للقانون المحلي.
          </p>
        </li>
        <li>
          <Text fz='h2' fw={700}>
            17. التنازل
          </Text>
          <p>
            لا يمكن أن تنقل ملكية أو تتنازل عن هذه الشروط وأية حقوق أو تراخيص قد تم منحها بموجبها، إنما يمكن أن توكل من
            mwz3 دون قيود. أي تنازل أو نقل تقوم به يكون باطل ودون مفعول.
          </p>
        </li>
        <li>
          <Text fz='h2' fw={700}>
            18. القدرة على قبول شروط الخدمة
          </Text>
          <p>
            ان هذا الموقع هو مخصص للبالغين فقط وإعلى أن تكون مؤهل للتعاقد وفقًا للقوانين المعمول بها. في حال كنت تستخدم
            / تدخل إلى هذا الموقع كممثل لأي شخص/ كيان، عليك ان تقر بأنك مخول قانونًا لتمثيل ذلك الشخص/الكيان. يُسمح
            للقاصرين أي المستخدمين ما دون 18 عامًا، بالدخول إلى الموقع الإلكتروني واستخدام الخدمة فقط في حالة موافقة
            ممثليهم القانونيين أو إذا كان ذلك يتعلق بفعل أو معاملة تعتبر معيارًا معتادًا ومقبولًا في الحياة والممارسة
            المدنية. إنك تؤكد أن عمرك لا يقل عن 18 عامًا أو إنك قاصر محرّر او تمتلك موافقة الوالدين أو الوصي القانوني
            وهم قادرون ومؤهلون تماما للدخول في البنود، الشروط، الالتزامات، التأكيدات، الاتفاقيات، العروض، الضمانات
            المنصوص عليها في هذه الشروط. كما انهم يمتثلون ويلتزمون بهذه الشروط. وبأي حال من الأحوال، إنك تؤكد أنك تجاوزت
            18 عامًا، نظرًا لأن الموقع الإلكتروني غير مخصص للأطفال دون 18 عامًا.
          </p>
          <Text fz='h3' fw={600}>
            إشعار للأطفال ما دون 18 سنة وأولياء أمرهم أو الاوصياء عليهم:
          </Text>
          <p>
            إذا كان عمرك أقل من 18 عامًا، يجب ألا تستخدم هذا الموقع. الرجاء عدم ارسالنا معلوماتك الشخصية بما في ذلك
            عناوين البريد الإلكتروني والاسم و/أو معلومات الاتصال الخاصة بك. اما في حال ترغب في الاتصال بنا، فيمكنك
            القيام بذلك فقط من خلال أحد والديك أو الوصي القانوني.
          </p>
        </li>
        <li>
          <Text fz='h2' fw={700}>
            19. معلومات عامة
          </Text>
          <p>
            تؤلف هذه الشروط والسياسات الأخرى المنشورة على الموقع الإلكتروني التفاهم والاتفاق الكامل والحصري بينك وبين
            mwz3 . ان هذه الشروط تحكم استخدامك للخدمة وللموقع الالكتروني وتحل محل كل التفاهمات السابقة والمقترحات
            والاتفاقات والمفاوضات والمناقشات بين الأطراف، سواء كانت خطية او شفهية. تخضع الشروط والعلاقة بينك وبين mwz3
            لقوانين مصر دون اعتبار تنازع القوانين الدولية. يتم تقديم أية دعوى ضد شركة mwz3 حصريا لمحاكم القاهرة ، مصر.
            لا يشكل إمتناع mwz3 عن ممارسة أو تطبيق أي حق أو شرط من الشروط تنازلاً عن هذا الحق أو الحكم. في حال كان أي
            شرط من الشروط غير صالح أو غير قابل للتطبيق من قبل محكمة مختصة، (بما في ذلك على سبيل المثال لا الحصر، بسبب ان
            هذا الحكم لا يتماشى مع قوانين ولاية قضائية أخرى)، مع ذلك يتفق الفريقان أن المحكمة يجب أن تسعى إلى تفعيل
            نوايا الاطراف على النحو الوارد في الحكم. إذا كان أي نص أو أحكام من هذه الشروط غير صالحة، غير قانونية أو غير
            قابلة للتنفيذ، لا تتأثر صلاحية وشرعية وإنفاذ الأحكام المتبقية من الشروط بأي شكل من الأشكال أو تتعرض لأي أذى.
            تضمن هذه الشروط مصلحة الفريقين وتربط كل من خلفاء الفريقين والمعينين.
          </p>
        </li>

        <li>
          <Text fz='h2' fw={700}>
            20. انتهاك الشروط والتعويض
          </Text>
          <p>
            نرجو منك إبلاغنا عن أية انتهاكات للشروط تصبح على وعي عنها عن طريق الاتصال بنا عبر استخدام الرابط الموجود
            أسفل صفحة mwz3الرئيسية على mwz3.com.eg أو بمعاينة قسم المساعدة. ان أي إمتناع في التصرف من قِبلmwz3 فيما
            يتعلق بخرق من قبلك أو من قبل الآخرين لا يؤدي الى تنازل عن حقنا في الرد فيما يتعلق بالانتهاكات اللاحقة أو
            المشابهة من قبلك أو من قبل الآخرين. بغض النظر عن البنود المذكورة أعلاه وفيما يختص بأي شرط آخر من هذه الشروط،
            تحتفظ mwz3 بالحق في طلب تعويضات قانونية ومنصفة، بما في ذلك على سبيل المثال لا الحصر، الأداء المحدد لأي شرط
            وارد في هذه الشروط، أو أمر قضائي أولي أو دائم، ضد خرق أو تهديد خرق أي شرط، أو المساعدة في ممارسة أية سلطة
            ممنوحة ضمن هذه الشروط أو أي الدمج فيها، دون ضرورة لنشر السند
          </p>
        </li>
      </List>
    </>
  );
}
